# import random
#
# print("50% шанс отримати тему для власного висловлення з української мови!")
#
# # Шаг 1: Определим список сообщений
# messages = [
#     "Підтримайте або спростуйте думку, висловлену Г. С. Сковородою: «Багатством живиться лише тіло. А душу звеселяє споріднена праця».",
#     "Підтримайте або спростуйте думку: «Ми – не безліч стандартних “я”, а безліч всесвітів різних».",
#     "Підтримайте або спростуйте думку: «Поразка – це наука. Ніяка перемога так не вчить…».",
#     "Підтримайте або спростуйте думку: «Потрібно цінувати те, що маєш, а не те, про що мрієш».",
#     "Підтримайте або спростуйте думку: «Зміни – найцікавіше в житті».",
#     "Підтримайте або спростуйте думку: «Будь-яка проблема – це можливість стати кращим».",
#     "Добро завжди має перемагати – це ми знаємо з дитинства. Але ж відомо, що будь-яка перемога пов’язана з певним насильством. Як добро має перемагати в нашому недоброму світі?",
#     "Чи потрібно людині шукати відповідь на питання про доцільність підкорення природи й володарювання над нею?",
#     "До кого ж приходить успіх у житті?"
# ]
#
# #Вірогідність отримання теми (50% за замовчуванням)
# chance_to_display_message = 0.5
#
# #Випадковий вибір теми
# if random.random() < chance_to_display_message:
#     # Выбираем случайное сообщение из списка
#     print(random.choice(messages))
# else:
#     print("Цього разу не повезло.")

import argparse
import logging
from message_pkg import generator

#Логування
logging.basicConfig(level=logging.INFO, format='%(asctime)s - %(levelname)s - %(message)s')

def main():
    parser = argparse.ArgumentParser(description="Отримайте випадкову ідею для власного висловлення.")
    parser.add_argument('--chance', type=float, default=0.5, help='Шанс отримання теми (за замовчуванням 50%)')
    args = parser.parse_args()

    #Лог запуску програми
    logging.info("Програма запущена із шансом: %s", args.chance)

    #Використання генератора для вибору теми
    message = generator.get_random_message(args.chance)

    #Виводимо результат
    print(message)

if __name__ == "__main__":
    main()
